Repository: jyritasa/SpaceApp
Catalog: lib/conf/l10n/app_*.arb
Languages: fi

# homePageTitle
source: SPACE
fi: AVARUUS

source: Refresh
fi: Päivitä

source: Download Image
fi: Tallenna Kuva

source: Creating File...
fi: Luodaan Tiedosta...

source: Done!
fi: Valmis!

source: Change Theme Color
fi: Vaihda Väri Teema

# resetThemeValues
source: Reset Color Values
fi: Resetoi Väri Arvot

# imageDownloadError
source: Unable to Download the image! Please try again later.
fi: Kuvan lataaminen epäonnistui! Kokeile uudelleen myöhemmin.

# infoText
source: This is an application for generating pictures of space with randomly generated stars and planets. You can set the background gradient color and download the generated work of art!
fi: Tämä on applikaatio kuvien luomiseen avaruudesta jossa sattunaisesti luotuja tähtiä ja planeettoja. Sinä voit vaihtaa taustan värigradientin ja lataa luodun taideteoksen!

# refreshText
source: You can generate a new picture by pressing the refresh button located in the bottom right corner.
fi: Voit luoda uuden kuvan paimalla oikeassa alakulmassa olevaa päivitä näppäintä.

# menuTitle
source: menu
fi: valikko

# menuText
source: You can access menu by pressing the button located at top left. There you can change color values with sliders, save the created image and view this message again.
fi: Pääset valikkoon painamalla vasemmassa yläkulmassa olevaa näppäintä. Siellä voit vaihtaa väri arvoja liukusäätimillä, tallentaa luodun kuvan ja lukea tämän vieatin uudelleen.

source: dismiss
fi: Sulje
